IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_pie_ctrl_regs.xml
	<register id="PIEIER3" width="16" page="1" offset="0x6" internal="0" description="Interrupt Group 3 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 3.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 3.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 3.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 3.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 3.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 3.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 3.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 3.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 3.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 3.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 3.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 3.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 3.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 3.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 3.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 3.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR3" width="16" page="1" offset="0x7" internal="0" description="Interrupt Group 3 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 3.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 3.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 3.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 3.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 3.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 3.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 3.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 3.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 3.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 3.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 3.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 3.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 3.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 3.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 3.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 3.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER4" width="16" page="1" offset="0x8" internal="0" description="Interrupt Group 4 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 4.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 4.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 4.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 4.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 4.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 4.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 4.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 4.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 4.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 4.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 4.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 4.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 4.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 4.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 4.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 4.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR4" width="16" page="1" offset="0x9" internal="0" description="Interrupt Group 4 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 4.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 4.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 4.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 4.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 4.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 4.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 4.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 4.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 4.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 4.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 4.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 4.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 4.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 4.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 4.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 4.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER5" width="16" page="1" offset="0xa" internal="0" description="Interrupt Group 5 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 5.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 5.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 5.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 5.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 5.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 5.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 5.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 5.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 5.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 5.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 5.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 5.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 5.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 5.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 5.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 5.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR5" width="16" page="1" offset="0xb" internal="0" description="Interrupt Group 5 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 5.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 5.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 5.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 5.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 5.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 5.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 5.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 5.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 5.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 5.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 5.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 5.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 5.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 5.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 5.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 5.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER6" width="16" page="1" offset="0xc" internal="0" description="Interrupt Group 6 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 6.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 6.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 6.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 6.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 6.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 6.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 6.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 6.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 6.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 6.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 6.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 6.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 6.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 6.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 6.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 6.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
