IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_pie_ctrl_regs.xml
	<register id="PIEIFR6" width="16" page="1" offset="0xd" internal="0" description="Interrupt Group 6 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 6.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 6.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 6.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 6.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 6.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 6.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 6.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 6.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 6.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 6.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 6.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 6.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 6.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 6.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 6.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 6.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER7" width="16" page="1" offset="0xe" internal="0" description="Interrupt Group 7 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 7.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 7.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 7.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 7.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 7.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 7.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 7.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 7.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 7.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 7.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 7.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 7.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 7.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 7.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 7.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 7.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR7" width="16" page="1" offset="0xf" internal="0" description="Interrupt Group 7 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 7.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 7.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 7.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 7.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 7.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 7.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 7.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 7.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 7.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 7.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 7.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 7.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 7.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 7.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 7.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 7.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER8" width="16" page="1" offset="0x10" internal="0" description="Interrupt Group 8 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 8.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 8.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 8.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 8.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 8.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 8.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 8.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 8.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 8.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 8.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 8.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 8.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 8.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 8.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 8.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 8.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR8" width="16" page="1" offset="0x11" internal="0" description="Interrupt Group 8 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 8.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 8.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 8.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 8.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 8.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 8.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 8.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 8.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 8.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 8.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 8.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 8.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 8.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 8.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 8.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 8.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
