IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_pie_ctrl_regs.xml
	<register id="PIEIER9" width="16" page="1" offset="0x12" internal="0" description="Interrupt Group 9 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 9.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 9.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 9.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 9.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 9.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 9.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 9.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 9.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 9.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 9.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 9.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 9.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 9.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 9.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 9.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 9.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR9" width="16" page="1" offset="0x13" internal="0" description="Interrupt Group 9 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 9.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 9.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 9.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 9.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 9.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 9.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 9.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 9.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 9.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 9.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 9.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 9.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 9.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 9.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 9.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 9.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER10" width="16" page="1" offset="0x14" internal="0" description="Interrupt Group 10 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 10.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 10.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 10.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 10.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 10.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 10.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 10.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 10.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 10.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 10.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 10.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 10.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 10.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 10.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 10.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 10.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR10" width="16" page="1" offset="0x15" internal="0" description="Interrupt Group 10 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 10.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 10.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 10.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 10.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 10.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 10.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 10.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 10.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 10.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 10.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 10.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 10.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 10.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 10.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 10.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 10.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
